"""
Беремо перший та останній біти вхідного рядка (0 і 0)
Перетворюємо їх на число в десятковій системі (00 = 0)

Беремо середні 4 біти (1111)
Перетворюємо їх на число в десятковій системі: 1111 (binary) = 15


Знаходимо значення на перетині рядка 0 та стовпця 15 --- 11
Число 11 представляємо у 4-бітному двійковому форматі: 1011"""
def des_s_box_n6(b):

    row = int(b[0] + b[5], 2)


    col = int(b[1:5], 2)

    s_box_6 = [
        [12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11],
        [10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8],
        [9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6],
        [4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13]
    ]

    res = s_box_6[row][col]
    return format(res, '04b'), res


b = "011110"
result = des_s_box_n6(b)
print(result)