"""
Беремо перший та останній біти вхідного рядка (0 і 0)
Перетворюємо їх на число в десятковій системі (00 = 0)

Беремо середні 4 біти (1111)
Перетворюємо їх на число в десятковій системі: 1111 (binary) = 15


Знаходимо значення на перетині рядка 0 та стовпця 15 --- 7
Число 7 представляємо у 4-бітному двійковому форматі: 0111"""
def des_s_box_n6(b):

    row = int(b[0] + b[5], 2)


    col = int(b[1:5], 2)
    s_box = [
        [14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7],
        [0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8],
        [4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0],
        [15, 12, 8, 2, 4, 9, 1, 7, 5, 11, 3, 14, 10, 0, 6, 13]
    ]

    res = s_box[row][col]
    return format(res, '04b'), res


b = "011110"
result = des_s_box_n6(b)
print(result)